["Why don't they talk about...\n#BBCDocumentary", "The entire world wants to Unite India!#BharatJodoYatra in Atlanta, USA #BBCDocumentary", "#BBCDocumentary. \"The carnage took place with the police standing by. A senior police officer told the BBC that they had been told to do nothing to stop the violence\"", "Most Important Part of the BBC Documentary\n\n#BBCDocumentary", "", "", "", "", "The origin of Godi Media\n\n#BBCDocumentary", "", "", "", "", "", "", "", "They boycott Pathaan and banned the BBC documentary, then Hindenburg came out of syllabus.", "", "", "", "", "", "", "Every time I watch this man, I die a little - of embarrassment. \n\nIn refuting the #BBCDocumentary the MEA has expanded the Modi-Shah toolkit to include “colonial mindset”. \n\nI guess we should rejoice they’re focused away from us sickular urban naxals ", "BBC adds Salman Khan Cameo in its Modi Documentary to reach more people \n\nReports \n@dudeitsokay", "", "", "", "", "", "BBC documentary in the works.\n\nSo I want to know: Did Richard Sharp have a hand in this doc & release?", "Shakeel Afsar a pakistani YouTube intimidated and abused British Indians and used uncouth words for the Hindu community. \n\nThe Indians were protesting against the biased propaganda telecasted in #BBCDocumentary against PM Modi.", "", "", "", "", "", " in the works.\n\nSo I want to know: Did Richard Sharp have a hand in this doc & release?", "Shakeel Afsar a pakistani YouTube intimidated and abused British Indians and used uncouth words for the Hindu community. \n\nThe Indians were protesting against the biased propaganda telecasted in #BBCDocumentary against PM Modi.", "It is alarming to know that banned \n@BBC\n documentary screened at the Andhra University campus is fully under the control of \n@YSJagan\n. \n\nNo action against perpetrators, Bind over cases on \n@ABVPVoice\n.", "", "", "", "", "", "", "", "", "\"Move on\", from Nellie, from Hashimpura, from Muzaffarnagar, from 1984, from Gujarat 2002, they said.\n\n\"Move on\" is the language of the insensitive, the abuser, and the enabler. \n#BBCDocumentary", "", "", "", "", "", "", "", "Madras University played #BBCDocumentary because they support absolute freedom of expression only as long as Abdul is happy.", "Dear Indian Muslims, do you believe #BBCDocumentary is to aid you? Nay, they just want to get rid of #Modi & settle their political scores. If you fall into this trap, then you’ll be the loser. \n\nRemember what Prophet ﷺ said, “The believer is not stung twice from the same hole”.", "", "", "", "", "Dear Indian Muslims, do you believe #BBCDocumentary is to aid you? Nay, they just want to get rid of #Modi & settle their political scores. If you fall into this trap, then you’ll be the loser. \n\nRemember what Prophet ﷺ said, “The believer is not stung twice from the same hole”.", "News channels have had a very tough week - #Pathaan, #BBCDocumentary & now #Hindenburg \nThey don't know how to handle these topics any more ... a distraction is on its way very soon to divert public attention.", "What was pappu doing meeting the BBC producer in London 6 months back ? \n\n#BBCQuitIndia \n#BBCDocumentary", "", "", "", "", "", "", "", "", "BBC Documentary on PM Modi screened at Valluvar Kottam in Chennai with police permission.", "", "", "", "", "", "", "", "", "BBC should focus on their burning domestic issues than poking in our long burried topics.\n#BBCDocumentary", "My new article “#BBC using Indian Muslims as cannon fodder against India’s leadership”. \n\nPlease read and share! Thanks in advance! \n\n#BBCDocumentary", "", "", "", "", "", "Every BBC documentary is only adding to the final tally of Mandate 2024.\n\n#Wokeflix", "", "", "", "", "", "", "", "", "", "British people sloganeering “Shame on you BBC” after their well-paid hitjob in the form of that documentary.", "Let the BBC make a documentary on what Hindus face in Pakistan. Then we will talk.", "", "", "", "", "Cong MPs speaking against the BBC documentary are shameless. Your own MP was murdered in the mob violence.", "The masterstroke part of BJP on the #BBCDocumentary is that if the Govt didn't ban it, many people would not have even heard of it. Streisand effect completely ignored.", "#BBCDocumentary  is perfect example of Failure of INDIA media houses... we have 1.4 Billion people and 100+ news channel... why these media houses can not expose Anti-India agenda ..", "BJP's Student wing ABVP to screen 'The Kashmir Files' in each university campus where left plans to screen the propaganda documentary by BBC on PM Modi.", "", "", "", "", "", "", "", "", "No ban can stop the screening of BBC documentary Gujarat riots and it's Butcher.", "", "", "", "", "", "", "", "", "Why is the BJP curbing free expression? Universities are meant to preserve and promote viewpoint diversity.\n\n#BBC #BBCDocumentary #ModiDocumentryRow", "Watched the second episode of the #BBCdocumentry on India's prime minister Modi. Chilling to see how consistently his administration has targeted and unleashed violence against Muslims! Banned across digital platforms in India but people are watching it.", "", "", "", "", "", "", "", "", "", "", "New Delhi (CNN) — India has banned a BBC documentary critical of Prime Minister Narendra Modi’s alleged role in deadly riots more than 20 years ago from being shown in the country, in a move critics decried as an assault on press freedom", "", "", "", "", "", "", "", "", "", "", "", "The disgraced \n@UKLabour\n Fmr Home Sec Mr '#WMDs' \n@JackStraw_MP\n revealing a nauseating 'white mans burden' attitude, quite incredible lack of self-awareness. Thank you \n@TVMohandasPai\n ji for nailing this issue re infiltration of the #BBC by pro islamist elements.#BBCDocumentary", "“…it is important that public broadcasters respect the sovereignty of…nations they serve while collaborating beyond borders for…greater global good…BBC’s documentary and its reporting from India…was violative of this principle…” ⁦\n@shashidigital\n⁩", "", "", "", "", "", "", "", "", "", "There is high probability that the #BBCDocumentary could also be traced back to usual suspects", "When India became a Republic on Jan. 26, 1950, could its people, heady with freedom after generations of colonial rule, ever have imagined that their country would turn into one where universities shut down power on campus to stop students accessing information? #BBCDocumentary", "", "", "", "", "", "", "", "", "Now I know why he never gives interviews. \n#BBCDocumentary #ModiDocumentaryRow #Modi #BBCQuitIndia #GujratRiots #Godhra", "Actress and comedian Emily Atack has spoken about the barrage of explicit images and messages she receives every day.\n\nShe told #BBCBreakfast why she decided to produce a deeply personal BBC Two documentary 'Emily Atack: Asking For It?'", "", "", "", "", "", "", "", "", "", "", "Twitter has blocked majority of tweets about the #BBCDocumentary in India. What happened to the promised freedom of speech \n@elonmusk\n?", "India blocks BBC documentary on Modi from airing in India http://reut.rs/3XtUW8G", "", "", "", "", "", "", "", "", "", "", "", "Kudos to my leader \n@MahuaMoitra\n for dragging the \n@narendramodi\n government to the Supreme Court over the \n@BBC\n documentary ban and asking the right questions to the \n@SEBI_India\n on the #AdaniScam.\n\nWill be her life-long fan for being a conviction politician in these testing times!", "Excellent. Must watch video by \n@palkisu\n @firstpost\n on biased \n@narendramodi\n #BBCDocumentary", "", "", "", "", "", "", "", "", "", "India says it has used emergency powers to block a BBC documentary about Indian Prime Minister Narendra Modi from being shared online", "#Opinion | What is the ‘Modi Question’ that #BBC has in mind? Nothing new has happened recently to raise this. Is it essentially that of growing political discomfort in some quarters in the West with India’s rise under a strong leader? By: Kanwal Sibal", "", "", "", "", "", "", "", "", "", "Just imagine the fear of Modi, that Congress and the entire opposition had to pay sacks full of money to the BBC, to make a documentary, go against the SC of India, to try and win the coming Lok Sabha elections!!\nSlow claps for them.", "#NewsKiPathshala \n@SushantBSinha\n @narendramodi\n These Indians are producing children like Rabbit let them Die with Hunger #WinstonChurchill #Congress who supported #UnitedKingdom . Hey #BBCDocumentary did you made any documentary on #BengalFamine or Criminal #WinstonChurchill ?", "", "", "", "", "", "", "", "", "", "Stressful week for Amit Malviya with release of Pathaan and BBC documentary", "In the name of Supreme Court, the ban on #BBCDocumentary is not only based on Fake narrative, but start a dangerous trend, that one can’t disagree with or criticize, or with objectivity judge, a SC Judgement https://twitter.com/mahuamoitra/status/1617352320161021952…"]